app/views/orders/show.html.erb

<h4>Statuses</h4>
    <% @order.statuses.each do |status| %>
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."order_id" IS NULL LIMIT ?  [["LIMIT", 1]]