app/controllers/orders_controller.rb

  def show
    @statuses = Status.find_by_order_id(params[:order_id])
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."order_id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @order = current_user.order.build(order_params)
    #@order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("user_id", "title", "destination", "reference", "dom", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Tawanda Brandon"], ["destination", "alskdaskl"], ["reference", ""], ["dom", ""], ["created_at", 2018-04-25 16:38:33 UTC], ["updated_at", 2018-04-25 16:38:33 UTC]]