app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "address", "issue", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.post.build(post_params)

    respond_to do |format|
      if @post.save