app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses"
---
  def index
    @statuses = Status.all

INSERT INTO "statuses" ("title", "status", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The best news"], ["status", "Done"], ["comment", "Done DOne DOne"], ["created_at", 2018-04-25 17:28:57 UTC], ["updated_at", 2018-04-25 17:28:57 UTC]]
---
  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_status
      @status = Status.find(params[:id])